kittiphun-rut/IV-Monitor-BCNPH/firmware/ESP32-S3-Station-V_7_7_2/ESP32-S3-Station-V_7_7_2.ino
void updateStationIdConfigDynamic() {
  long msLeft = (long)configAutoSaveTimeout - (long)millis();
  int leftSec = (msLeft > 0) ? (int)(msLeft / 1000) + 1 : 0;
  String key = String(tempConfigStationId) + ":" + String(leftSec);
  if (key == cacheConfig) return;
  cacheConfig = key;

  tft.fillRect(40, 84, 92, 108, UI_CARD);
  drawCenteredString(String(tempConfigStationId), 90, 12, THEME_SKYBLUE, UI_CARD);
  drawCenteredString(padTo("SAVING IN " + String(leftSec) + "s", 16), 302, 1, COLOR_YELLOW, THEME_BG);
}

// ----------------------------------------------------------------------------
// ปุ่มกด
// ----------------------------------------------------------------------------
void handleButton() {
  static unsigned long btnPressStart = 0;
  static bool isHolding = false;
  static int clickCount = 0;
  static unsigned long lastReleaseTime = 0;

  bool reading = (digitalRead(BTN_PIN) == LOW);
  unsigned long now = millis();

  if (reading && !isHolding) {
    btnPressStart = now;
    isHolding = true;
    isHoldUiActive = false;
    holdBeep3sDone = false;
    holdBeep5sDone = false;
    lastUserActivityTime = now;
  }
  else if (reading && isHolding) {
    unsigned long holdDur = now - btnPressStart;
    if (holdDur >= 400 && currentState != STATE_CONFIG_ID) {
      isHoldUiActive = true;
      if (holdDur >= 3000 && !holdBeep3sDone) {
        beepNonBlocking(2200, 50);
        holdBeep3sDone = true;
      }
      if (holdDur >= 5000 && !holdBeep5sDone) {
        beepNonBlocking(2600, 80);
        holdBeep5sDone = true;
      }
      if (now - lastHoldRenderTime >= 35) {
        lastHoldRenderTime = now;
        drawHoldProgressHUD(holdDur);
      }
    }
  }
  else if (!reading && isHolding) {
    unsigned long pressDur = now - btnPressStart;
    isHolding = false;
    lastUserActivityTime = now;

    if (isHoldUiActive) {
      isHoldUiActive = false;
      clickCount = 0;
      if (pressDur >= 5000) {
        soundScreensaver();
        currentState = STATE_CREDIT;
        stateNeedsRedraw = true;
      } else if (pressDur >= 3000) {
        executeButtonCalibrationWizard();
      } else {
        soundClick();
        stateNeedsRedraw = true;
      }
      return;
    }
    else if (pressDur > 30 && pressDur < 400) {
      clickCount++;
      lastReleaseTime = now;
    }
  }

  if (clickCount > 0 && !isHolding && (now - lastReleaseTime > 280)) {
    int clicks = clickCount;
    clickCount = 0;

    if (currentState == STATE_CONFIG_ID) {
      soundClick();
      if (clicks >= 2) {
        // ดับเบิลคลิก = สลับจอกลับหัว 180 องศา เห็นผลทันที แล้วจำค่าไว้เลย
        applyScreenRotation(screenRotation == TFT_ROT_FLIP180 ? TFT_ROT_NORMAL
                                                              : TFT_ROT_FLIP180);
        saveScreenRotation();
      } else {
        tempConfigStationId = (tempConfigStationId % 8) + 1;
      }
      configAutoSaveTimeout = now + 4000;
      return;
    }

    if (currentState == STATE_EMERGENCY) {
      if (clicks >= 2) {
        togglePause();                         // หยุดนับ เช่น ขณะเปลี่ยนถุง/แก้สายพับ
      } else {
        snoozeUntilTime = now + SNOOZE_MS;
        noTone(BUZZER_PIN);
        buzzerBeepUntil = 0;
        soundClick();
      }
      currentState = STATE_NORMAL_VIEW;
      stateNeedsRedraw = true;
      return;
    }

    if (currentState == STATE_NEAR_END_NOTICE) {
      acknowledgeNearEnd();                    // คลิกกี่ครั้งก็ได้ = รับทราบ
      currentState = STATE_NORMAL_VIEW;
      currentNursePage = 1;
      stateNeedsRedraw = true;
      return;
    }

    if (currentState == STATE_CREDIT) {
      soundClick();
      currentState = STATE_NORMAL_VIEW;
      stateNeedsRedraw = true;
      return;
    }

    if (clicks >= 3) {
      soundClick();
      noTone(BUZZER_PIN);
      tempConfigStationId = currentStationId;
      configAutoSaveTimeout = now + 4000;
      currentState = STATE_CONFIG_ID;
      stateNeedsRedraw = true;
    }
    else if (clicks == 2) {
      togglePause();
      if (currentState == STATE_SCREENSAVER) currentState = STATE_NORMAL_VIEW;
    }
    else {
      soundClick();
      if (currentState == STATE_SCREENSAVER) {
        currentState = STATE_NORMAL_VIEW;
      } else {
        currentNursePage = (currentNursePage % 4) + 1;
      }
      stateNeedsRedraw = true;
    }
  }
}

// ----------------------------------------------------------------------------
// Setup
// ----------------------------------------------------------------------------
void setup() {
  Serial.begin(115200);

  setenv("TZ", "ICT-7", 1);
  tzset();

  pinMode(BUZZER_PIN, OUTPUT); noTone(BUZZER_PIN);
  pinMode(TFT_BLK, OUTPUT); digitalWrite(TFT_BLK, HIGH);
  pinMode(BTN_PIN, INPUT_PULLUP);
  pinMode(SENSOR_AO_PIN, INPUT);

  analogReadResolution(12);
  analogSetAttenuation(ADC_11db);

  iv::DetectorConfig dcfg;              // ค่าเริ่มต้นเหมาะกับเซนเซอร์ IR ของโครงการนี้
  detector.begin(dcfg);
  detector.reset(analogRead(SENSOR_AO_PIN));

  SPI_TFT.begin(TFT_SCLK, -1, TFT_MOSI, TFT_CS);
  tft.init(172, 320);
  tft.setSPISpeed(40000000);
  tft.setRotation(TFT_ROTATION_DEFAULT);
  tft.setTextWrap(false);

  stationPrefs.begin("st_cfg", false);
  currentStationId = stationPrefs.getUChar("id", 1);
  savedChannel     = stationPrefs.getUChar("ch", DEFAULT_ESPNOW_CHANNEL);
  uint8_t savedRot = stationPrefs.getUChar("rot", TFT_ROTATION_DEFAULT);
  stationPrefs.end();
  applyScreenRotation(savedRot);   // ทิศจอที่เคยตั้งไว้ที่หน้าเครื่อง
  if (currentStationId < 1 || currentStationId > 8) currentStationId = 1;

  // ---- กันสเตชันหลายตัวส่งชนกัน ----
  // เมล็ดสุ่มมาจาก MAC (ไม่ซ้ำกันทุกบอร์ด) และรอบแรกเหลื่อมกันตามเลขเตียง
  // ทำให้แพ็กเก็ตของแต่ละเตียงกระจายกันทั้งวินาทีตั้งแต่บูต ไม่ต้องรอให้ jitter ค่อย ๆ แยก
  {
    uint8_t mac[6] = {0};
    WiFi.macAddress(mac);
    randomSeed(((uint32_t)mac[5] << 16) ^ ((uint32_t)mac[4] << 8) ^ (uint32_t)mac[3]
               ^ ((uint32_t)currentStationId << 24) ^ (uint32_t)micros());
    lastSendTime  = millis();
    nextSendDelay = (unsigned long)currentStationId * (SEND_INTERVAL_MS / 9);
  }
  if (savedChannel < 1 || savedChannel > MAX_WIFI_CHANNEL) savedChannel = DEFAULT_ESPNOW_CHANNEL;

  loadLearning();   // ใส่สิ่งที่เคยเรียนรู้ไว้กลับเข้าไป ให้พร้อมใช้งานเร็วขึ้น

  setLedColor(0, 40, 80);
  resetTrendData();
  trendLastSample = millis();

  tft.fillScreen(THEME_BG);
  drawCenteredString("SMART IV", 60, 3, THEME_SKYBLUE, THEME_BG);
  drawCenteredString("ALERT", 92, 2, THEME_PINK, THEME_BG);

  char bedBuf[12];
  snprintf(bedBuf, sizeof(bedBuf), "BED %02d", currentStationId);
  tft.fillRoundRect(26, 140, 120, 48, 8, THEME_SKYBLUE);
  drawCenteredString(String(bedBuf), 154, 3, THEME_BG, THEME_SKYBLUE);

  drawCenteredString("Bed Station Node", 214, 1, UI_DIM, THEME_BG);
  drawCenteredString("FW v" APP_VERSION, 232, 1, THEME_SKYBLUE, THEME_BG);
  drawCenteredString("BCN Phrae Innovation", 256, 1, UI_DIM, THEME_BG);

  playWelcomeMelody();
  delay(600);

  WiFi.mode(WIFI_STA);
  WiFi.disconnect();
  WiFi.setSleep(false);
  setEspNowChannel(savedChannel);

